---
kind: method
id: M:Autodesk.Revit.DB.PolymeshTopology.GetNormals
source: html/8bc4e4ba-1c62-d342-4ca5-1417f0bac8c2.htm
---
# Autodesk.Revit.DB.PolymeshTopology.GetNormals Method

Returns all normals assigned to the polymesh

## Syntax (C#)
```csharp
public IList<XYZ> GetNormals()
```

## Returns
An array of XYZ values, each representing a normal vector